In [2]:
from sqlalchemy import create_engine

db_string = "postgresql://wbauer_adb:adb2020@pgsql-196447.vipserv.org:5432/wbauer_adb"

db = create_engine(db_string)

connection_sqlalchemy = db.connect()

In [3]:
import psycopg2 as pg
import pandas as pd

connection = pg.connect(host='pgsql-196447.vipserv.org', port=5432, dbname='wbauer_adb', user='wbauer_adb', password='adb2020')

1. Ile kategorii filmów mamy w wypożyczalni?

In [4]:
df = pd.read_sql('select DISTINCT name from category',con=connection)
print(len(df.index))

16

2. Wyświetl listę kategorii w kolejności alfabetycznej.

In [5]:
df = pd.read_sql('select DISTINCT name FROM category ORDER BY name ',con=connection)
print(df)

           name
0        Action
1     Animation
2      Children
3      Classics
4        Comedy
5   Documentary
6         Drama
7        Family
8       Foreign
9         Games
10       Horror
11        Music
12          New
13       Sci-Fi
14       Sports
15       Travel

3. Znajdź najstarszy i najmłodszy film do wypożyczenia.

In [6]:
df = pd.read_sql('SELECT release_year, title FROM film ORDER BY release_year',con=connection)
print(df)
print("Wszystkie filmy są z tego samego roku")

     release_year              title
0            2006    Chamber Italian
1            2006   Grosse Wonderful
2            2006    Airport Pollock
3            2006  Bright Encounters
4            2006   Academy Dinosaur
..            ...                ...
995          2006     Young Language
996          2006         Youth Kick
997          2006       Zhivago Core
998          2006  Zoolander Fiction
999          2006          Zorro Ark

[1000 rows x 2 columns]
Wszystkie filmy są z tego samego roku

4. Ile wypożyczeń(tylko wypożyczenie) odbyło się między 2005-07-01 a 2005-08-01?

In [7]:
df = pd.read_sql("SELECT rental_date FROM rental WHERE rental_date BETWEEN '2005-07-01 00:00:00' AND '2005-08-01 23:59:59'", con = connection)
print(len(df.index))

7380

5. Ile wypożyczeń(wypożyczenie i oddanie) odbyło się między 2010-01-01 a 2011-02-01?

In [8]:
df = pd.read_sql("SELECT rental_date, return_date FROM rental WHERE (rental_date BETWEEN '2005-01-01 00:00:00' AND '2011-02-01 23:59:59') AND (return_date BETWEEN '2005-01-01 00:00:00' AND '2011-02-01 23:59:59') ", con = connection)
print(df)
print(len(df.index))

              rental_date         return_date
0     2005-05-24 22:54:33 2005-05-28 19:40:33
1     2005-05-24 23:03:39 2005-06-01 22:12:39
2     2005-05-24 23:04:41 2005-06-03 01:43:41
3     2005-05-24 23:05:21 2005-06-02 04:33:21
4     2005-05-24 23:08:07 2005-05-27 01:32:07
...                   ...                 ...
15856 2005-08-23 22:26:47 2005-08-27 18:02:47
15857 2005-08-23 22:42:48 2005-08-25 02:48:48
15858 2005-08-23 22:43:07 2005-08-31 21:33:07
15859 2005-08-23 22:50:12 2005-08-30 01:01:12
15860 2005-05-24 22:53:30 2005-05-26 22:04:30

[15861 rows x 2 columns]
15861

6. Znajdź największą płatność wypożyczenia.

In [9]:
df = pd.read_sql("SELECT MAX(amount) FROM payment ", con = connection)
print(df['max'][0])

11.99

7. Znajdź wszystkich klientów z Polski, Nigerii lub Bangladeszu.

In [10]:
#df1 = pd.read_sql("SELECT * FROM country", con = connection)
df = pd.read_sql("SELECT * FROM customer_list WHERE country = 'Poland' or country = 'Nigeria' or country = 'Bangladesh'", con = connection)
print(df)

     id              name                         address zip code  \
0   284     Sonia Gregory              1279 Udine Parkway    75860
1   318       Brian Wyman                 1769 Iwaki Lane    25787
2   572   Sidney Burleson             1405 Hagonoy Avenue    86587
3   409    Rodney Moeller          1936 Lapu-Lapu Parkway     7122
4   332    Stephen Qualls                1838 Tabriz Lane     1195
5   286       Velma Lucas            1155 Liaocheng Place    22650
6    80      Marilyn Ross                1888 Kabul Drive    20936
7   198      Elsie Kelley                 955 Bamenda Way     1545
8   103   Gladys Hamilton                 1177 Jelets Way     3305
9   329    Frank Waggoner             1816 Bydgoszcz Loop    64308
10  128   Marjorie Tucker        1050 Garden Grove Avenue     4999
11   18      Carol Garcia                320 Brest Avenue    43331
12  270       Leah Curtis                  906 Goinia Way    83565
13  501       Ruben Geary          414 Mandaluyong Street    16370
14  277      Olga Jimenez                556 Baybay Manor    55802
15  156   Bertha Ferguson               1367 Yantai Manor    21294
16  280    Tracey Barrett  1006 Santa Brbara dOeste Manor    36229
17  250         Jo Fowler            786 Stara Zagora Way    98332
18  571  Johnnie Chisholm      1501 Pangkal Pinang Avenue      943
19  562     Wallace Slone                 1342 Sharja Way    93655
20   21    Michelle Clark  262 A Corua (La Corua) Parkway    34418
21  380   Russell Brinson     1642 Charlotte Amalie Drive    75442
22  558  Jimmie Eggleston            505 Madiun Boulevard    97271
23  232    Constance Reid               885 Yingkou Manor    31390

           phone             city     country   notes  sid
0   195003555232       Benin City     Nigeria  active    1
1   556100547674        Bydgoszcz      Poland  active    1
2   867287719310      Czestochowa      Poland  active    1
3   653436985797        Deba Habe     Nigeria  active    2
4    38988715447            Dhaka  Bangladesh  active    1
5   558236142492     Effon-Alaiye     Nigeria  active    1
6   701457319790              Ife     Nigeria  active    1
7   768481779568           Ikerre     Nigeria  active    2
8   484292626944           Ilorin     Nigeria  active    1
9   965273813662         Jamalpur  Bangladesh  active    2
10  973047364353  Jastrzebie-Zdrj      Poland  active    1
11  747791594069           Kaduna     Nigeria  active    2
12  701767622697           Kalisz      Poland  active    1
13   52709222667           Lublin      Poland  active    1
14  363982224739        Ogbomosho     Nigeria  active    2
15  889538496300             Ondo     Nigeria  active    1
16   85059738746              Owo     Nigeria  active    2
17  716256596301              Oyo     Nigeria  active    2
18  770864062795            Plock      Poland  active    2
19  946114054231           Sokoto     Nigeria  active    1
20  892775750063          Tangail  Bangladesh  active    1
21  821476736117            Tychy      Poland  active    1
22  970638808606          Wroclaw      Poland  active    1
23  588964509072            Zaria     Nigeria  active    2

8. Gdzie mieszkają członkowie personelu?

In [11]:
df = pd.read_sql("SELECT address FROM staff_list", con = connection)
print(df)

                address
0     23 Workhaven Lane
1  1411 Lillydale Drive

9. Ilu pracowników mieszka w Argentynie lub Hiszpanii?

In [12]:
df = pd.read_sql("SELECT count(country) FROM staff_list WHERE country = 'Argentina' or country = 'Spain'", con = connection)
print(df)

   count
0      0

10. Jakie kategorie filmów zostały wypożyczone przez klientów?

In [13]:
df = pd.read_sql("""
SELECT name FROM category WHERE category_id IN
(
    SELECT DISTINCT category_id FROM film_category WHERE film_id IN
    (
        SELECT DISTINCT film_id FROM inventory WHERE film_id IN 
        (
            SELECT DISTINCT inventory_id FROM rental
        )
    )

)
""", con = connection)
print(df)

           name
0        Family
1        Travel
2        Sports
3      Classics
4        Action
5           New
6        Comedy
7        Horror
8      Children
9        Sci-Fi
10        Music
11        Games
12      Foreign
13  Documentary
14    Animation
15        Drama

11. Znajdź wszystkie kategorie filmów wypożyczonych w Ameryce.(Rozumiem Amerykę jako USA)

In [14]:


df = pd.read_sql("""
SELECT store_id FROM store WHERE address_id IN(
    SELECT address_id FROM address WHERE city_id IN(
        SELECT city_id FROM city WHERE country_id IN(
            SELECT country_id FROM country WHERE country = 'United States'
        )
    )
)
""", con = connection)
print(df)
print("Brak wypożyczalni w Ameryce")

Empty DataFrame
Columns: [store_id]
Index: []
Brak wypożyczalni w Ameryce

12. Znajdź wszystkie tytuły filmów, w których grał: Olympia Pfeiffer lub Julia Zellweger lub Ellen Presley

In [15]:


df = pd.read_sql("""
SELECT title FROM film WHERE film_id IN(
    SELECT film_id FROM film_actor WHERE actor_id IN(
        SELECT actor_id FROM actor WHERE (first_name = 'Olympia' and last_name = 'Pfeiffer') or (first_name = 'Julia' and last_name = 'Zellweger') or (first_name = 'Ellen' and last_name = 'Presley') 
    )
)


""", con = connection)
print(df)

                title
0   Caribbean Liberty
1      Roots Remember
2        Outlaw Hanky
3        Women Dorado
4    Empire Malkovich
..                ...
64  Contact Anonymous
65    Majestic Floats
66       Deep Crusade
67   Effect Gladiator
68     Express Lonely

[69 rows x 1 columns]